/** 卡池信息 version2.5 start */
const pool = {
    upPool1: {
        star5: {
            up: ["雷电将军"],
            noUp: ["刻晴", "莫娜", "七七", "迪卢克", "琴"]
        },
        star4: {
            up: ["九条裟罗", "辛焱", "班尼特"],
            noUpRole: ["云堇", "五郎", "早柚", "托马", "烟绯", "罗莎莉亚", "砂糖", "迪奥娜", "重云", "诺艾尔", "菲谢尔", "凝光", "行秋", "北斗", "香菱", "雷泽", "芭芭拉"],
            noUpArms: ["弓藏", "祭礼弓", "绝弦", "西风猎弓", "昭心", "祭礼残章", "流浪乐章", "西风秘典", "西风长枪", "匣里灭辰", "雨裁", "祭礼大剑", "钟剑", "西风大剑", "匣里龙吟", "祭礼剑", "笛剑", "西风剑"]
        },
        star3: ["弹弓", "神射手之誓", "鸦羽弓", "翡玉法球", "讨龙英杰谭", "魔导绪论", "黑缨枪", "以理服人", "沐浴龙血的剑", "铁影阔剑", "飞天御剑", "黎明神剑", "冷刃"]
    },
    upPool2: {
        star5: {
            up: ["心海"],
            noUp: ["刻晴", "莫娜", "七七", "迪卢克", "琴"]
        },
        star4: {
            up: ["九条裟罗", "辛焱", "班尼特"],
            noUpRole: ["云堇", "五郎", "早柚", "托马", "烟绯", "罗莎莉亚", "砂糖", "迪奥娜", "重云", "诺艾尔", "菲谢尔", "凝光", "行秋", "北斗", "香菱", "雷泽", "芭芭拉"],
            noUpArms: ["弓藏", "祭礼弓", "绝弦", "西风猎弓", "昭心", "祭礼残章", "流浪乐章", "西风秘典", "西风长枪", "匣里灭辰", "雨裁", "祭礼大剑", "钟剑", "西风大剑", "匣里龙吟", "祭礼剑", "笛剑", "西风剑"]
        },
        star3: ["弹弓", "神射手之誓", "鸦羽弓", "翡玉法球", "讨龙英杰谭", "魔导绪论", "黑缨枪", "以理服人", "沐浴龙血的剑", "铁影阔剑", "飞天御剑", "黎明神剑", "冷刃"]
    },
    armsPool: {
        star5: {
            up: ["薙草之稻光", "不灭月华"],
            noUp: ["阿莫斯", "天空之翼", "四风原典", "天空之卷", "和璞鸢", "天空之脊", "狼的末路", "天空之傲", "天空之刃", "风鹰剑"]
        },
        star4: {
            up: ["曚云之月", "祭礼残章", "西风长枪", "恶王丸", "匣里龙吟"],
            noUpRole: ["云堇", "九条裟罗", "五郎", "早柚", "托马", "烟绯", "罗莎莉亚", "辛焱", "砂糖", "迪奥娜", "重云", "诺艾尔", "班尼特", "菲谢尔", "凝光", "行秋", "北斗", "香菱", "雷泽", "芭芭拉"],
            noUpArms: ["弓藏", "祭礼弓", "绝弦", "西风猎弓", "昭心", "流浪乐章", "西风秘典", "匣里灭辰", "雨裁", "祭礼大剑", "钟剑", "西风大剑", "祭礼剑", "笛剑", "西风剑"]
        },
        star3: ["弹弓", "神射手之誓", "鸦羽弓", "翡玉法球", "讨龙英杰谭", "魔导绪论", "黑缨枪", "以理服人", "沐浴龙血的剑", "铁影阔剑", "飞天御剑", "黎明神剑", "冷刃"]
    },
    permanentPool: {
        star5: {
            role: ["刻晴", "莫娜", "七七", "迪卢克", "琴"],
            arms: ["阿莫斯", "天空之翼", "四风原典", "天空之卷", "和璞鸢", "天空之脊", "狼的末路", "天空之傲", "天空之刃", "风鹰剑"]
        },
        star4: {
            role: ["云堇", "九条裟罗", "五郎", "早柚", "托马", "烟绯", "罗莎莉亚", "辛焱", "砂糖", "迪奥娜", "重云", "诺艾尔", "班尼特", "菲谢尔", "凝光", "行秋", "北斗", "香菱", "安柏", "雷泽", "凯亚", "芭芭拉", "丽莎"],
            arms: ["弓藏", "祭礼弓", "绝弦", "西风猎弓", "昭心", "祭礼残章", "流浪乐章", "西风秘典", "西风长枪", "匣里灭辰", "雨裁", "祭礼大剑", "钟剑", "西风大剑", "匣里龙吟", "祭礼剑", "笛剑", "西风剑"]
        },
        star3: ["弹弓", "神射手之誓", "鸦羽弓", "翡玉法球", "讨龙英杰谭", "魔导绪论", "黑缨枪", "以理服人", "沐浴龙血的剑", "铁影阔剑", "飞天御剑", "黎明神剑", "冷刃"]
    }
}
/** 卡池信息 version2.5 end */
export default pool;